app/Controllers/Artikel.php

    public function index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->select('artikel.*, kategori.nama_kategori')
            ->findAll();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`

    public function view($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->select('artikel.*, kategori.nama_kategori')
            ->where('slug', $slug)
            ->first();
---
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `slug` = 'cara-membuat-website-sederhana'
 LIMIT 1

    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $q     = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $model = new ArtikelModel();

        $builder = $model
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->select('artikel.*, kategori.nama_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $data = [
            'title'       => $title,
            'q'           => $q,
            'kategori_id' => $kategori_id,
            'artikel'     => $builder->paginate(10),
            'pager'       => $model->pager,
            'kategori'    => (new KategoriModel())->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Operator produksi%' ESCAPE '!'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`judul` LIKE '%Operator produksi%' ESCAPE '!'
 LIMIT 10
SELECT *
FROM `kategori`

    public function add()
{
    $validation = \Config\Services::validation();
    $validation->setRules([
        'judul'       => 'required',
        'isi'         => 'required',
        'id_kategori' => 'required|integer',
        'gambar'      => 'uploaded[gambar]|is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]'
    ]);

    if (!$validation->withRequest($this->request)->run()) {
        $kategoriModel = new KategoriModel();
        return view('artikel/form_add', [
            'title'      => 'Tambah Artikel',
            'kategori'   => $kategoriModel->findAll(),
---
SELECT *
FROM `kategori`

    public function edit($id)
    {
        $artikel = new ArtikelModel();
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
            'gambar'      => 'permit_empty|is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]'
        ]);

        $dataLama = $artikel->find($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '35'

                $updateData['gambar'] = $namaFile;
            }

            $artikel->update($id, $updateData);
---
UPDATE `artikel` SET `judul` = 'hlo', `isi` = ' jnjnj', `id_kategori` = '3'
WHERE `artikel`.`id` IN ('35')